Repository: cimth/QuizMaster-Frontend
Catalog: src/locale/messages.*.xlf
Languages: de

# ngb.alert.close
source: Close
de: Schließen

# ngb.carousel.previous
source: Previous
de: Vorherige

# ngb.carousel.next
source: Next
de: Nächste

# ngb.datepicker.select-month
source: Select month
de: Monat auswählen

# ngb.datepicker.select-year
source: Select year
de: Jahr auswählen

# ngb.datepicker.previous-month
source: Previous month
de: Vorheriger Monat

# ngb.datepicker.next-month
source: Next month
de: Nächster Monat

# ngb.pagination.first-aria
source: First
de: Erste

# ngb.pagination.previous-aria
source: Previous
de: Vorherige

# ngb.pagination.next-aria
source: Next
de: Nächste

# ngb.pagination.last-aria
source: Last
de: Letzte

# ngb.timepicker.hours
source: Hours
de: Stunden

# ngb.timepicker.minutes
source: Minutes
de: Minuten

# ngb.timepicker.increment-hours
source: Increment hours
de: Stunden inkrementieren

# ngb.timepicker.decrement-hours
source: Decrement hours
de: Stunden dekrementieren

# ngb.timepicker.increment-minutes
source: Increment minutes
de: Minuten inkrementieren

# ngb.timepicker.decrement-minutes
source: Decrement minutes
de: Minuten dekrementieren

# ngb.timepicker.seconds
source: Seconds
de: Sekunden

# ngb.timepicker.increment-seconds
source: Increment seconds
de: Sekunden inkrementieren

# ngb.timepicker.decrement-seconds
source: Decrement seconds
de: Sekunden dekrementieren

# backToStart
source: Back to the main menu
de: Zurück zum Hauptmenü

# hdrError
source: Error!
de: Fehler!

source: Add Quiz
de: Quiz hinzufügen

source: Question Count
de: Anzahl der Fragen

source: Used Questions
de: Verwendete Fragen

# noUsedQuestions
source: There are no questions are assigned to this Quiz yet.
de: Aktuell sind diesem Quiz keine Fragen zugeordnet.

source: Unused Questions
de: Nicht verwendete Fragen

# noUnusedQuestions
source: All existing questions are already assigned to this Quiz.
de: Aktuell sind diesem Quiz bereits alle existierenden Fragen zugeordnet.

source: Cancel
de: Abbrechen

source: Save
de: Speichern

# errorEmptyInputFields
source: The shown input fields must not be empty.
de: Die angezeigten Eingabefelder dürfen nicht leer sein.

# successQuizCreated
source: The Quiz was successfully created!
de: Das Quiz wurde erfolgreich erstellt!

# errorBackendNotReachable
source: The server is not reachable.
de: Der Server ist momentan nicht erreichbar.

source: Delete Quiz
de: Quiz löschen

# confirmationRequestDeleteQuiz
source: Do you really wish to delete the Quiz?
de: Soll das Quiz wirklich gelöscht werden?

source: Delete
de: Löschen

# errorMissingAdminToken
source: The Admin Token is missing.
de: Das Admin-Token fehlt.

source: Edit Quiz
de: Quiz bearbeiten

source: Manage predefined Quizzes
de: Vorgegebene Quiz-Runden verwalten

source: Add predefined Quiz
de: Vorgegebene Quiz-Runde hinzufügen

# noPredefinedQuiz
source: There are no predefined Quizzes available.
de: Aktuell gibt es keine vorgegebenen Quiz-Runden.

source: Questions
de: Fragen

source: Actions
de: Aktionen

source: Edit
de: Bearbeiten

source: Add Question
de: Frage hinzufügen

source: Question Text
de: Frage

source: Correct Answer
de: Richtige Antwort

source: Wrong Answer 1
de: Falsche Antwort 1

source: Wrong Answer 2
de: Falsche Antwort 2

source: Wrong Answer 3
de: Falsche Antwort 3

# successQuestionCreated
source: The Question was successfully created!
de: Die Frage wurde erfolgreich erstellt!

source: Delete Question
de: Frage löschen

# confirmationRequestDeleteQuestion
source: Do you really wish to delete the Question?
de: Soll die Frage wirklich gelöscht werden?

source: Edit Question
de: Frage bearbeiten

source: Edit Answers
de: Antworten bearbeiten

# doNotEditAnswers
source: Don't edit Answers
de: Antworten nicht bearbeiten

source: Manage Questions
de: Fragen verwalten

# noQuestions
source: There are no questions available.
de: Es sind keine Fragen verfügbar.

source: Show Answers
de: Antworten anzeigen

source: Hide Answers
de: Antworten verstecken

# hdrFinished
source: Finished!
de: Geschafft!

source: Correct Answers:
de: Richtige Antworten:

source: Wrong Answers:
de: Falsche Antworten:

source: Question
de: Frage

source: Next Question
de: Nächste Frage

source: Finish Quiz
de: Quiz beenden

source: Select predefined Quiz
de: Vorgegebene Quiz-Runde auswählen

source: Play
de: Spielen

source: Select Quiz format
de: Quiz-Format auswählen

# startingQuiz
source: Quiz is being started
de: Das Quiz wird gestartet

source: Continue previous started Quiz
de: Vorheriges Quiz fortsetzen

source: Random Quiz
de: Zufälliges Quiz

source: Predefined Quiz
de: Vorgegebenes Quiz

# createRandomQuiz
source: Create a random Quiz
de: Zufälliges Quiz erstellen

# noRandomQuizSinceNoQuestions
source: You have not created any questions yet. Thus, you cannot play a random Quiz.
de: Bisher wurden keine Fragen erstellt. Deshalb kann kein zufälliges Quiz gespielt werden.

# playQuiz
source: Play a Quiz
de: Ein Quiz spielen
